upload_performance_result/metrics/sglang/20260730/test_npu_qwen3_6_35b_a3b_1p_in128k_out1k_prefix90_50ms__20260729.txt
memfabric_hybrid          1.0.8
sgl_kernel_npu            2026.6.1
sglang                    0.5.17.dev331+ge1f2f9d1f       /sgl-workspace/sglang/python
sglang-router             0.3.2
torch                     2.10.0+cpu
torch_npu                 2.10.0
torchao                   0.9.0
torchaudio                2.10.0+cpu
torchvision               0.25.0+cpu
CANN: 9.0.0
transformers: 5.12.1
/sgl-workspace/sglang/python/sglang/bench_serving.py:13: FutureWarning: `sglang.bench_serving` is deprecated and will be removed in a future release; use `sglang.benchmark.serving` instead (e.g. `python -m sglang.benchmark.serving`).
  warnings.warn(
benchmark_args=Namespace(backend='sglang', base_url=None, host='127.0.0.1', port=20866, ready_check_timeout_sec=60, dataset_name='generated-shared-prefix', dataset_path='', dataset_offset=0, agentic_max_turns=None, speed_bench_category=None, speed_bench_output_len=512, model='/root/.cache/modelscope/hub/models/Qwen/Qwen3.6-35B-A3B', served_model_name=None, tokenizer=None, num_prompts=412, sharegpt_output_len=None, sharegpt_context_len=None, random_input_len=1024, random_output_len=1024, random_range_ratio=0.0, image_count=1, image_resolution='1080p', random_image_count=False, image_format='jpeg', image_content='random', request_rate=inf, use_trace_timestamps=False, max_concurrency=103, output_file=None, output_details=False, print_requests=False, disable_tqdm=False, disable_stream=False, return_logprob=False, top_logprobs_num=0, token_ids_logprob=None, logprob_start_len=-1, return_routed_experts=False, cache_report=False, seed=42, disable_ignore_eos=False, temperature=0.0, top_p=1.0, extra_request_body=None, apply_chat_template=False, profile=False, plot_throughput=False, profile_activities=['CPU', 'GPU'], profile_start_step=None, profile_steps=None, profile_num_steps=None, profile_by_stage=False, profile_stages=None, profile_output_dir=None, profile_prefix=None, lora_name=None, lora_request_distribution='uniform', lora_zipf_alpha=1.5, prompt_suffix='', pd_separated=False, profile_prefill_url=None, profile_decode_url=None, flush_cache=False, warmup_requests=1, tokenize_prompt=False, gsp_num_groups=1, gsp_prompts_per_group=412, gsp_system_prompt_len=115200, gsp_question_len=12799, gsp_output_len=1000, gsp_range_ratio=1.0, gsp_fast_prepare=False, gsp_send_routing_key=False, gsp_num_turns=1, gsp_ordered=False, gsp_group_distribution='uniform', gsp_zipf_alpha=None, mooncake_slowdown_factor=1.0, mooncake_num_rounds=1, mooncake_workload='conversation', fake_prefill=False, tag=None, header=None)
Waiting up to 60s for http://127.0.0.1:20866/v1/models to become ready...
Server ready in 0.0s.
Namespace(backend='sglang', base_url=None, host='127.0.0.1', port=20866, ready_check_timeout_sec=60, dataset_name='generated-shared-prefix', dataset_path='', dataset_offset=0, agentic_max_turns=None, speed_bench_category=None, speed_bench_output_len=512, model='/root/.cache/modelscope/hub/models/Qwen/Qwen3.6-35B-A3B', served_model_name=None, tokenizer=None, num_prompts=412, sharegpt_output_len=None, sharegpt_context_len=None, random_input_len=1024, random_output_len=1024, random_range_ratio=0.0, image_count=1, image_resolution='1080p', random_image_count=False, image_format='jpeg', image_content='random', request_rate=inf, use_trace_timestamps=False, max_concurrency=103, output_file=None, output_details=False, print_requests=False, disable_tqdm=False, disable_stream=False, return_logprob=False, top_logprobs_num=0, token_ids_logprob=None, logprob_start_len=-1, return_routed_experts=False, cache_report=False, seed=42, disable_ignore_eos=False, temperature=0.0, top_p=1.0, extra_request_body=None, apply_chat_template=False, profile=False, plot_throughput=False, profile_activities=['CPU', 'GPU'], profile_start_step=None, profile_steps=None, profile_num_steps=None, profile_by_stage=False, profile_stages=None, profile_output_dir=None, profile_prefix=None, lora_name=None, lora_request_distribution='uniform', lora_zipf_alpha=1.5, prompt_suffix='', pd_separated=False, profile_prefill_url=None, profile_decode_url=None, flush_cache=False, warmup_requests=1, tokenize_prompt=False, gsp_num_groups=1, gsp_prompts_per_group=412, gsp_system_prompt_len=115200, gsp_question_len=12799, gsp_output_len=1000, gsp_range_ratio=1.0, gsp_fast_prepare=False, gsp_send_routing_key=False, gsp_num_turns=1, gsp_ordered=False, gsp_group_distribution='uniform', gsp_zipf_alpha=None, mooncake_slowdown_factor=1.0, mooncake_num_rounds=1, mooncake_workload='conversation', fake_prefill=False, tag=None, header=None)


Loading cached generated input data from /root/.cache/sglang/benchmark/gen_shared_prefix_42_1_412_115200_12799_1000_Qwen2Tokenizer.pkl
Starting warmup with 1 sequences...
Warmup completed with 1 sequences. Starting main benchmark run...

  0%|          | 0/412 [00:00<?, ?it/s]
  0%|          | 1/412 [00:58<6:39:43, 58.35s/it]
  3%|▎         | 11/412 [01:04<29:24,  4.40s/it] 
  3%|▎         | 13/412 [01:15<30:48,  4.63s/it]
  3%|▎         | 14/412 [01:16<27:43,  4.18s/it]
  4%|▍         | 16/412 [01:26<29:04,  4.41s/it]
  4%|▍         | 17/412 [01:40<39:12,  5.96s/it]
  4%|▍         | 18/412 [01:41<32:28,  4.95s/it]
  5%|▌         | 22/412 [01:43<17:28,  2.69s/it]
  7%|▋         | 27/412 [02:06<22:43,  3.54s/it]
  7%|▋         | 28/412 [02:06<20:23,  3.19s/it]
  7%|▋         | 29/412 [02:13<23:24,  3.67s/it]
  7%|▋         | 30/412 [02:13<19:56,  3.13s/it]
  8%|▊         | 31/412 [02:17<21:09,  3.33s/it]
  8%|▊         | 32/412 [02:30<34:47,  5.49s/it]
  8%|▊         | 33/412 [02:31<27:18,  4.32s/it]
  9%|▉         | 39/412 [02:48<20:27,  3.29s/it]
 10%|▉         | 40/412 [02:48<18:06,  2.92s/it]
 10%|█         | 42/412 [02:56<19:08,  3.10s/it]
 10%|█         | 43/412 [02:57<17:07,  2.79s/it]
 11%|█         | 44/412 [02:57<14:30,  2.36s/it]
 11%|█         | 45/412 [03:00<15:16,  2.50s/it]
 11%|█▏        | 47/412 [03:22<34:46,  5.72s/it]
 12%|█▏        | 48/412 [03:23<28:05,  4.63s/it]
 13%|█▎        | 52/412 [03:25<14:32,  2.42s/it]
 13%|█▎        | 53/412 [03:37<23:41,  3.96s/it]
 13%|█▎        | 54/412 [03:38<19:50,  3.32s/it]
 14%|█▎        | 56/412 [03:44<19:25,  3.27s/it]
 14%|█▍        | 57/412 [03:47<19:33,  3.31s/it]
 14%|█▍        | 58/412 [03:48<16:06,  2.73s/it]
 14%|█▍        | 59/412 [03:51<16:20,  2.78s/it]
 15%|█▍        | 60/412 [03:52<13:26,  2.29s/it]
 15%|█▍        | 61/412 [03:56<16:21,  2.79s/it]
 15%|█▌        | 62/412 [03:58<14:59,  2.57s/it]
 15%|█▌        | 63/412 [04:14<37:12,  6.40s/it]
 16%|█▌        | 64/412 [04:15<27:25,  4.73s/it]
 16%|█▋        | 67/412 [04:17<14:05,  2.45s/it]
 17%|█▋        | 68/412 [04:26<22:26,  3.92s/it]
 17%|█▋        | 69/412 [04:27<18:04,  3.16s/it]
 17%|█▋        | 70/412 [04:28<15:49,  2.78s/it]
 18%|█▊        | 73/412 [04:40<18:25,  3.26s/it]
 18%|█▊        | 74/412 [04:41<15:57,  2.83s/it]
 18%|█▊        | 75/412 [04:47<20:28,  3.64s/it]
 18%|█▊        | 76/412 [04:48<16:22,  2.92s/it]
 19%|█▊        | 77/412 [04:52<18:41,  3.35s/it]
 19%|█▉        | 78/412 [04:53<14:34,  2.62s/it]
 19%|█▉        | 79/412 [05:06<31:12,  5.62s/it]
 19%|█▉        | 80/412 [05:07<23:34,  4.26s/it]
 20%|█▉        | 82/412 [05:11<17:31,  3.19s/it]
 20%|██        | 83/412 [05:15<17:58,  3.28s/it]
 20%|██        | 84/412 [05:16<14:43,  2.69s/it]
 21%|██        | 86/412 [05:17<10:26,  1.92s/it]
 21%|██        | 87/412 [05:22<13:29,  2.49s/it]
 21%|██▏       | 88/412 [05:23<11:15,  2.09s/it]
 22%|██▏       | 89/412 [05:23<09:26,  1.75s/it]
 22%|██▏       | 90/412 [05:30<16:27,  3.07s/it]
 22%|██▏       | 91/412 [05:31<13:00,  2.43s/it]
 22%|██▏       | 92/412 [05:37<19:31,  3.66s/it]
 23%|██▎       | 93/412 [05:38<15:00,  2.82s/it]
 23%|██▎       | 94/412 [05:45<21:51,  4.12s/it]
 23%|██▎       | 95/412 [05:57<33:02,  6.26s/it]
 23%|██▎       | 96/412 [05:58<24:24,  4.63s/it]
 24%|██▎       | 97/412 [06:01<22:57,  4.37s/it]
 24%|██▍       | 99/412 [06:05<16:47,  3.22s/it]
 24%|██▍       | 100/412 [06:06<13:21,  2.57s/it]
 25%|██▍       | 101/412 [06:12<18:00,  3.47s/it]
 25%|██▍       | 102/412 [06:12<14:02,  2.72s/it]
 25%|██▌       | 103/412 [06:18<18:25,  3.58s/it]
 25%|██▌       | 104/412 [06:19<14:09,  2.76s/it]
 25%|██▌       | 105/412 [06:24<17:13,  3.37s/it]
 26%|██▌       | 106/412 [06:25<13:20,  2.62s/it]
 26%|██▌       | 107/412 [06:26<11:42,  2.30s/it]
 26%|██▌       | 108/412 [06:28<11:18,  2.23s/it]
 26%|██▋       | 109/412 [06:33<15:13,  3.02s/it]
 27%|██▋       | 110/412 [06:35<12:48,  2.55s/it]
 27%|██▋       | 111/412 [06:45<24:06,  4.81s/it]
 27%|██▋       | 112/412 [06:46<18:34,  3.72s/it]
 27%|██▋       | 113/412 [06:50<19:13,  3.86s/it]
 28%|██▊       | 114/412 [06:54<19:04,  3.84s/it]
 28%|██▊       | 115/412 [07:02<25:34,  5.17s/it]
 28%|██▊       | 116/412 [07:04<20:06,  4.08s/it]
 28%|██▊       | 117/412 [07:05<16:50,  3.43s/it]
 29%|██▊       | 118/412 [07:09<17:23,  3.55s/it]
 29%|██▉       | 119/412 [07:16<21:18,  4.36s/it]
 29%|██▉       | 120/412 [07:16<15:44,  3.24s/it]
 29%|██▉       | 121/412 [07:23<20:49,  4.29s/it]
 30%|██▉       | 122/412 [07:24<15:38,  3.24s/it]
 30%|██▉       | 123/412 [07:27<15:25,  3.20s/it]
 30%|███       | 124/412 [07:28<11:53,  2.48s/it]
 30%|███       | 125/412 [07:33<16:10,  3.38s/it]
 31%|███       | 126/412 [07:35<14:11,  2.98s/it]
 31%|███       | 127/412 [07:47<27:15,  5.74s/it]
 31%|███       | 128/412 [07:48<19:52,  4.20s/it]
 31%|███▏      | 129/412 [07:49<16:04,  3.41s/it]
 32%|███▏      | 130/412 [07:55<18:38,  3.97s/it]
 32%|███▏      | 131/412 [07:57<15:41,  3.35s/it]
 32%|███▏      | 132/412 [07:58<13:10,  2.82s/it]
 32%|███▏      | 133/412 [08:00<11:50,  2.55s/it]
 33%|███▎      | 134/412 [08:04<13:28,  2.91s/it]
 33%|███▎      | 135/412 [08:12<21:15,  4.61s/it]
 33%|███▎      | 136/412 [08:13<15:40,  3.41s/it]
 33%|███▎      | 137/412 [08:16<15:16,  3.33s/it]
 33%|███▎      | 138/412 [08:17<11:29,  2.52s/it]
 34%|███▎      | 139/412 [08:21<13:45,  3.02s/it]
 34%|███▍      | 140/412 [08:26<15:48,  3.49s/it]
 34%|███▍      | 141/412 [08:31<17:41,  3.92s/it]
 34%|███▍      | 142/412 [08:34<17:36,  3.91s/it]
 35%|███▍      | 143/412 [08:38<17:12,  3.84s/it]
 35%|███▍      | 144/412 [08:39<13:47,  3.09s/it]
 36%|███▌      | 147/412 [08:41<07:29,  1.70s/it]
 36%|███▌      | 148/412 [08:51<14:37,  3.33s/it]
 36%|███▌      | 149/412 [08:55<15:49,  3.61s/it]
 36%|███▋      | 150/412 [08:57<13:34,  3.11s/it]
 37%|███▋      | 151/412 [09:00<13:59,  3.22s/it]
 37%|███▋      | 152/412 [09:01<10:51,  2.51s/it]
 37%|███▋      | 154/412 [09:05<10:01,  2.33s/it]
 38%|███▊      | 155/412 [09:13<15:30,  3.62s/it]
 38%|███▊      | 156/412 [09:14<12:21,  2.90s/it]
 38%|███▊      | 157/412 [09:22<18:09,  4.27s/it]
 38%|███▊      | 158/412 [09:23<15:02,  3.55s/it]
 39%|███▉      | 160/412 [09:25<09:49,  2.34s/it]
 39%|███▉      | 161/412 [09:26<08:13,  1.97s/it]
 39%|███▉      | 162/412 [09:33<13:44,  3.30s/it]
 40%|███▉      | 163/412 [09:37<14:28,  3.49s/it]
 40%|███▉      | 164/412 [09:45<19:46,  4.78s/it]
 40%|████      | 165/412 [09:46<14:50,  3.60s/it]
 40%|████      | 166/412 [09:47<12:09,  2.96s/it]
 41%|████      | 167/412 [09:51<13:28,  3.30s/it]
 41%|████      | 169/412 [10:02<17:19,  4.28s/it]
 41%|████▏     | 170/412 [10:04<14:41,  3.64s/it]
 42%|████▏     | 171/412 [10:10<17:07,  4.26s/it]
 42%|████▏     | 173/412 [10:23<20:32,  5.16s/it]
 42%|████▏     | 175/412 [10:24<13:51,  3.51s/it]
 43%|████▎     | 176/412 [10:27<13:03,  3.32s/it]
 43%|████▎     | 177/412 [10:32<14:33,  3.72s/it]
 43%|████▎     | 178/412 [10:33<11:39,  2.99s/it]
 43%|████▎     | 179/412 [10:40<15:48,  4.07s/it]
 44%|████▎     | 180/412 [10:41<12:14,  3.17s/it]
 44%|████▍     | 181/412 [10:44<12:10,  3.16s/it]
 44%|████▍     | 182/412 [10:45<09:32,  2.49s/it]
 45%|████▍     | 185/412 [10:54<10:44,  2.84s/it]
 45%|████▌     | 186/412 [10:55<09:07,  2.42s/it]
 45%|████▌     | 187/412 [11:02<12:58,  3.46s/it]
 46%|████▌     | 188/412 [11:09<16:39,  4.46s/it]
 46%|████▌     | 189/412 [11:11<13:55,  3.74s/it]
 46%|████▌     | 190/412 [11:12<10:59,  2.97s/it]
 46%|████▋     | 191/412 [11:13<08:56,  2.43s/it]
 47%|████▋     | 193/412 [11:22<12:20,  3.38s/it]
 47%|████▋     | 194/412 [11:25<11:49,  3.25s/it]
 47%|████▋     | 195/412 [11:28<11:57,  3.31s/it]
 48%|████▊     | 196/412 [11:29<09:25,  2.62s/it]
 48%|████▊     | 197/412 [11:34<11:54,  3.33s/it]
 48%|████▊     | 198/412 [11:35<09:15,  2.59s/it]
 48%|████▊     | 199/412 [11:39<10:12,  2.87s/it]
 49%|████▊     | 200/412 [11:40<08:35,  2.43s/it]
 49%|████▉     | 201/412 [11:42<08:03,  2.29s/it]
 49%|████▉     | 202/412 [11:50<13:37,  3.89s/it]
 50%|████▉     | 204/412 [12:00<15:35,  4.50s/it]
 50%|█████     | 206/412 [12:02<10:44,  3.13s/it]
 50%|█████     | 207/412 [12:04<09:28,  2.77s/it]
 50%|█████     | 208/412 [12:06<08:51,  2.61s/it]
 51%|█████     | 209/412 [12:10<10:39,  3.15s/it]
 51%|█████     | 210/412 [12:11<08:17,  2.46s/it]
 51%|█████     | 211/412 [12:14<08:49,  2.63s/it]
 51%|█████▏    | 212/412 [12:15<06:50,  2.05s/it]
 52%|█████▏    | 213/412 [12:18<07:39,  2.31s/it]
 52%|█████▏    | 214/412 [12:23<10:32,  3.20s/it]
 52%|█████▏    | 216/412 [12:27<08:51,  2.71s/it]
 53%|█████▎    | 217/412 [12:31<09:24,  2.89s/it]
 53%|█████▎    | 218/412 [12:33<08:31,  2.64s/it]
 53%|█████▎    | 219/412 [12:40<12:22,  3.85s/it]
 53%|█████▎    | 220/412 [12:45<13:52,  4.33s/it]
 54%|█████▎    | 221/412 [12:46<10:24,  3.27s/it]
 54%|█████▍    | 222/412 [12:51<12:09,  3.84s/it]
 54%|█████▍    | 223/412 [12:52<09:07,  2.90s/it]
 54%|█████▍    | 224/412 [12:58<12:23,  3.96s/it]
 55%|█████▍    | 225/412 [12:59<09:14,  2.97s/it]
 55%|█████▌    | 228/412 [13:08<09:29,  3.10s/it]
 56%|█████▌    | 229/412 [13:09<07:51,  2.58s/it]
 56%|█████▌    | 230/412 [13:19<13:20,  4.40s/it]
 56%|█████▋    | 232/412 [13:21<09:04,  3.02s/it]
 57%|█████▋    | 233/412 [13:23<08:11,  2.74s/it]
 57%|█████▋    | 234/412 [13:32<12:14,  4.13s/it]
 57%|█████▋    | 235/412 [13:32<09:31,  3.23s/it]
 57%|█████▋    | 236/412 [13:37<10:59,  3.75s/it]
 58%|█████▊    | 237/412 [13:38<08:23,  2.88s/it]
 58%|█████▊    | 238/412 [13:42<09:35,  3.30s/it]
 58%|█████▊    | 239/412 [13:43<07:20,  2.55s/it]
 58%|█████▊    | 240/412 [13:48<09:30,  3.32s/it]
 59%|█████▊    | 242/412 [13:53<08:07,  2.86s/it]
 59%|█████▉    | 243/412 [13:54<06:31,  2.32s/it]
 59%|█████▉    | 244/412 [13:57<07:09,  2.56s/it]
 59%|█████▉    | 245/412 [13:58<06:09,  2.21s/it]
 60%|█████▉    | 246/412 [14:05<09:27,  3.42s/it]
 60%|██████    | 248/412 [14:08<07:22,  2.70s/it]
 60%|██████    | 249/412 [14:10<06:45,  2.49s/it]
 61%|██████    | 250/412 [14:14<08:01,  2.97s/it]
 61%|██████    | 251/412 [14:15<06:16,  2.34s/it]
 61%|██████    | 252/412 [14:21<08:54,  3.34s/it]
 61%|██████▏   | 253/412 [14:23<07:30,  2.83s/it]
 62%|██████▏   | 254/412 [14:27<09:00,  3.42s/it]
 62%|██████▏   | 255/412 [14:28<06:53,  2.64s/it]
 62%|██████▏   | 256/412 [14:35<10:09,  3.91s/it]
 62%|██████▏   | 257/412 [14:36<07:34,  2.93s/it]
 63%|██████▎   | 258/412 [14:42<10:26,  4.07s/it]
 63%|██████▎   | 259/412 [14:43<07:56,  3.11s/it]
 63%|██████▎   | 260/412 [14:46<07:53,  3.11s/it]
 63%|██████▎   | 261/412 [14:49<07:31,  2.99s/it]
 64%|██████▎   | 262/412 [14:54<09:08,  3.65s/it]
 64%|██████▍   | 263/412 [14:55<06:59,  2.81s/it]
 64%|██████▍   | 264/412 [14:59<07:39,  3.11s/it]
 64%|██████▍   | 265/412 [15:00<05:55,  2.42s/it]
 65%|██████▍   | 267/412 [15:10<09:06,  3.77s/it]
 65%|██████▌   | 268/412 [15:11<07:08,  2.98s/it]
 66%|██████▌   | 270/412 [15:17<06:50,  2.89s/it]
 66%|██████▌   | 271/412 [15:22<08:23,  3.57s/it]
 66%|██████▌   | 272/412 [15:24<07:00,  3.00s/it]
 66%|██████▋   | 273/412 [15:26<06:24,  2.77s/it]
 67%|██████▋   | 274/412 [15:31<07:48,  3.40s/it]
 67%|██████▋   | 275/412 [15:36<08:39,  3.79s/it]
 67%|██████▋   | 276/412 [15:38<07:24,  3.27s/it]
 67%|██████▋   | 277/412 [15:40<06:28,  2.88s/it]
 67%|██████▋   | 278/412 [15:46<08:39,  3.88s/it]
 68%|██████▊   | 279/412 [15:53<10:33,  4.76s/it]
 68%|██████▊   | 282/412 [16:00<07:35,  3.50s/it]
 69%|██████▊   | 283/412 [16:05<07:55,  3.69s/it]
 69%|██████▉   | 284/412 [16:07<06:58,  3.27s/it]
 69%|██████▉   | 285/412 [16:10<07:11,  3.40s/it]
 69%|██████▉   | 286/412 [16:15<07:43,  3.68s/it]
 70%|██████▉   | 287/412 [16:15<05:57,  2.86s/it]
 70%|██████▉   | 288/412 [16:21<07:42,  3.73s/it]
 70%|███████   | 289/412 [16:23<06:38,  3.24s/it]
 70%|███████   | 290/412 [16:25<05:48,  2.86s/it]
 71%|███████   | 291/412 [16:29<06:24,  3.18s/it]
 71%|███████   | 292/412 [16:37<08:53,  4.44s/it]
 71%|███████   | 293/412 [16:38<06:39,  3.36s/it]
 71%|███████▏  | 294/412 [16:41<06:48,  3.46s/it]
 72%|███████▏  | 296/412 [16:45<05:08,  2.66s/it]
 72%|███████▏  | 297/412 [16:46<04:34,  2.39s/it]
 72%|███████▏  | 298/412 [16:52<06:19,  3.33s/it]
 73%|███████▎  | 299/412 [16:53<04:58,  2.64s/it]
 73%|███████▎  | 300/412 [16:58<06:04,  3.26s/it]
 73%|███████▎  | 301/412 [17:00<05:20,  2.89s/it]
 73%|███████▎  | 302/412 [17:06<06:47,  3.71s/it]
 74%|███████▎  | 303/412 [17:08<05:59,  3.30s/it]
 74%|███████▍  | 304/412 [17:09<04:36,  2.56s/it]
 74%|███████▍  | 305/412 [17:14<05:53,  3.31s/it]
 74%|███████▍  | 306/412 [17:21<08:08,  4.61s/it]
 75%|███████▍  | 307/412 [17:22<06:03,  3.47s/it]
 75%|███████▍  | 308/412 [17:26<06:04,  3.50s/it]
 75%|███████▌  | 309/412 [17:26<04:31,  2.64s/it]
 75%|███████▌  | 310/412 [17:32<05:57,  3.50s/it]
 75%|███████▌  | 311/412 [17:33<04:46,  2.84s/it]
 76%|███████▌  | 312/412 [17:39<05:58,  3.59s/it]
 76%|███████▌  | 313/412 [17:39<04:24,  2.67s/it]
 76%|███████▌  | 314/412 [17:43<04:56,  3.02s/it]
 76%|███████▋  | 315/412 [17:45<04:17,  2.65s/it]
 77%|███████▋  | 316/412 [17:50<05:27,  3.41s/it]
 77%|███████▋  | 317/412 [17:51<04:29,  2.84s/it]
 77%|███████▋  | 318/412 [17:58<05:59,  3.83s/it]
 78%|███████▊  | 320/412 [18:01<04:23,  2.86s/it]
 78%|███████▊  | 322/412 [18:07<04:13,  2.81s/it]
 78%|███████▊  | 323/412 [18:08<03:35,  2.42s/it]
 79%|███████▊  | 324/412 [18:14<04:50,  3.30s/it]
 79%|███████▉  | 325/412 [18:14<03:51,  2.67s/it]
 79%|███████▉  | 327/412 [18:19<03:32,  2.50s/it]
 80%|███████▉  | 328/412 [18:24<04:11,  3.00s/it]
 80%|████████  | 330/412 [18:31<04:28,  3.27s/it]
 80%|████████  | 331/412 [18:31<03:30,  2.60s/it]
 81%|████████  | 332/412 [18:38<04:41,  3.52s/it]
 81%|████████  | 333/412 [18:38<03:30,  2.67s/it]
 81%|████████  | 334/412 [18:44<04:37,  3.56s/it]
 81%|████████▏ | 335/412 [18:44<03:21,  2.61s/it]
 82%|████████▏ | 338/412 [18:54<03:44,  3.04s/it]
 82%|████████▏ | 339/412 [18:58<03:52,  3.19s/it]
 83%|████████▎ | 340/412 [18:59<03:17,  2.74s/it]
 83%|████████▎ | 342/412 [19:08<03:54,  3.35s/it]
 83%|████████▎ | 344/412 [19:12<03:23,  3.00s/it]
 84%|████████▎ | 345/412 [19:13<02:45,  2.46s/it]
 84%|████████▍ | 346/412 [19:18<03:19,  3.02s/it]
 84%|████████▍ | 347/412 [19:18<02:30,  2.31s/it]
 84%|████████▍ | 348/412 [19:25<03:45,  3.52s/it]
 85%|████████▍ | 349/412 [19:26<03:07,  2.97s/it]
 85%|████████▍ | 350/412 [19:31<03:29,  3.37s/it]
 85%|████████▌ | 351/412 [19:31<02:29,  2.45s/it]
 86%|████████▌ | 353/412 [19:41<03:34,  3.64s/it]
 86%|████████▌ | 354/412 [19:41<02:43,  2.82s/it]
 86%|████████▌ | 355/412 [19:46<03:06,  3.28s/it]
 86%|████████▋ | 356/412 [19:46<02:16,  2.43s/it]
 87%|████████▋ | 357/412 [19:48<02:06,  2.30s/it]
 87%|████████▋ | 358/412 [19:51<02:13,  2.48s/it]
 87%|████████▋ | 359/412 [19:53<02:05,  2.36s/it]
 87%|████████▋ | 360/412 [19:56<02:14,  2.58s/it]
 88%|████████▊ | 361/412 [20:00<02:29,  2.93s/it]
 88%|████████▊ | 362/412 [20:01<02:05,  2.51s/it]
 88%|████████▊ | 363/412 [20:10<03:32,  4.33s/it]
 88%|████████▊ | 364/412 [20:12<02:55,  3.66s/it]
 89%|████████▉ | 366/412 [20:19<02:45,  3.60s/it]
 89%|████████▉ | 367/412 [20:24<02:56,  3.93s/it]
 89%|████████▉ | 368/412 [20:26<02:28,  3.37s/it]
 90%|████████▉ | 369/412 [20:31<02:41,  3.75s/it]
 90%|████████▉ | 370/412 [20:31<01:56,  2.78s/it]
 90%|█████████ | 371/412 [20:37<02:29,  3.66s/it]
 90%|█████████ | 372/412 [20:38<01:55,  2.88s/it]
 91%|█████████ | 374/412 [20:43<01:41,  2.67s/it]
 92%|█████████▏| 377/412 [20:52<01:41,  2.89s/it]
 92%|█████████▏| 378/412 [20:56<01:42,  3.03s/it]
 92%|█████████▏| 379/412 [21:00<01:52,  3.41s/it]
 92%|█████████▏| 381/412 [21:07<01:42,  3.32s/it]
 93%|█████████▎| 382/412 [21:07<01:21,  2.71s/it]
 93%|█████████▎| 383/412 [21:15<01:55,  3.99s/it]
 93%|█████████▎| 384/412 [21:16<01:25,  3.06s/it]
 93%|█████████▎| 385/412 [21:21<01:35,  3.52s/it]
 94%|█████████▎| 386/412 [21:22<01:14,  2.86s/it]
 94%|█████████▍| 387/412 [21:24<01:04,  2.60s/it]
 94%|█████████▍| 388/412 [21:25<00:56,  2.34s/it]
 94%|█████████▍| 389/412 [21:30<01:08,  2.97s/it]
 95%|█████████▍| 390/412 [21:30<00:46,  2.13s/it]
 95%|█████████▍| 391/412 [21:37<01:17,  3.67s/it]
 95%|█████████▌| 392/412 [21:37<00:53,  2.66s/it]
 96%|█████████▌| 394/412 [21:46<01:01,  3.39s/it]
 96%|█████████▌| 396/412 [21:49<00:43,  2.73s/it]
 96%|█████████▋| 397/412 [21:54<00:47,  3.18s/it]
 97%|█████████▋| 399/412 [21:59<00:38,  2.93s/it]
 97%|█████████▋| 400/412 [22:00<00:28,  2.35s/it]
 97%|█████████▋| 401/412 [22:00<00:21,  1.99s/it]
 98%|█████████▊| 402/412 [22:00<00:15,  1.52s/it]
 98%|█████████▊| 403/412 [22:01<00:10,  1.17s/it]
 98%|█████████▊| 404/412 [22:02<00:09,  1.18s/it]
 98%|█████████▊| 405/412 [22:06<00:13,  1.92s/it]
 99%|█████████▊| 406/412 [22:06<00:08,  1.40s/it]
 99%|█████████▉| 407/412 [22:06<00:05,  1.04s/it]
 99%|█████████▉| 408/412 [22:10<00:07,  1.88s/it]
 99%|█████████▉| 409/412 [22:10<00:04,  1.49s/it]
100%|█████████▉| 411/412 [22:12<00:01,  1.11s/it]
100%|██████████| 412/412 [22:12<00:00,  1.02s/it]
100%|██████████| 412/412 [22:12<00:00,  3.24s/it]

============ Serving Benchmark Result ============
Backend:                                 sglang    
Traffic request rate:                    inf       
Max request concurrency:                 103       
Successful requests:                     412       
Benchmark duration (s):                  1332.96   
Total input tokens:                      56370405  
Total input text tokens:                 56370405  
Total generated tokens:                  412000    
Total generated tokens (retokenized):    327490    
Request throughput (req/s):              0.31      
Input token throughput (tok/s):          42289.66  
Output token throughput (tok/s):         309.09    
Peak output token throughput (tok/s):    15698.00  
Peak concurrent requests:                113       
Total token throughput (tok/s):          42598.74  
Concurrency:                             92.87     
Accept length:                           3.80      
----------------End-to-End Latency----------------
Mean E2E Latency (ms):                   300465.02 
Median E2E Latency (ms):                 324732.10 
P90 E2E Latency (ms):                    348451.10 
P95 E2E Latency (ms):                    358088.06 
P99 E2E Latency (ms):                    369411.60 
---------------Time to First Token----------------
Mean TTFT (ms):                          257268.26 
Median TTFT (ms):                        280674.03 
P90 TTFT (ms):                           302472.94 
P95 TTFT (ms):                           307189.18 
P99 TTFT (ms):                           318568.01 
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          43.24     
Median TPOT (ms):                        43.50     
P90 TPOT (ms):                           55.30     
P95 TPOT (ms):                           58.71     
P99 TPOT (ms):                           64.37     
---------------Inter-Token Latency----------------
Mean ITL (ms):                           43.36     
Median ITL (ms):                         16.21     
P90 ITL (ms):                            23.68     
P95 ITL (ms):                            153.12    
P99 ITL (ms):                            784.38    
Max ITL (ms):                            17626.28  
==================================================

# [collect_metrics] 文件原始修改时间: 2026-07-30 07:58:51
# [collect_metrics] 源目录日期: 20260729